tap "homebrew/bundle"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Banner-like program prints strings as ASCII art
brew "figlet"
# GNU compiler collection
brew "gcc"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Interactive environments for writing and running code
brew "jupyterlab"
# Rainbows and unicorns in your console!
brew "lolcat"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package for scientific computing with Python
brew "numpy", link: false
# Theme for zsh
brew "powerlevel10k"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Minimal installer for conda
cask "miniconda"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Open-source version of the X.Org X Window System
cask "xquartz"
